{
  "name": "Jesús Martín",
  "email": "jmartinruiz26@gmail.com",
  "github": "jaysusm",
  "mainDescription": "I'm a full-stack Software Engineer based in Spain.",
  "about": "I'm a graduated <b>Software Engineer</b> with over four years of experience. I'm passionate about <b>Full-Stack Development</b>, <b>DevOps</b>, and <b>Cloud Infrastructure</b>. Based in Málaga, Spain, I thrive on creating and maintaining dynamic applications. I love exploring new technologies and am committed to delivering high-quality code.\n\nOn the backend, I specialize in <b>Node.js</b> with <b>Express.js</b> for event-driven applications and have extensive experience with <b>RabbitMQ</b> for event-driven architectures to boost performance.\n\nOn the frontend, I focus on <b>React</b> for dynamic UIs and <b>Next.js</b> for server-side rendering and static sites. I’ve also worked with <b>Angular</b> and prefer <b>Tailwind CSS</b> for fast, responsive designs.\n\nIn DevOps, I can work on tasks such as automating and preparing deployments. I deploy with <b>Kubernetes</b>, manage infrastructure with <b>Terraform</b>, and set up CI/CD processes. I deploy frontend apps with <b>Vercel</b> and manage cloud resources with <b>AWS</b>.",
  "socials": {
    "linkedin": "/in/jesusm26",
    "email": "jmartinruiz26@gmail.com",
    "github": "JaysusM"
  },
  "projects": [
    {
      "title": "Portfolio",
      "subtitle": "Personal portfolio website",
      "image": "/jaybook_portfolio.png",
      "description": "This is my personal portfolio website, built with the <b>Astro</b> framework. It showcases my work, skills, and experience. The site is fully responsive, optimized for performance, and deployed on <b>Vercel</b>.",
      "techIcons": ["Astro"],
      "sourceCode": "https://github.com/JaysusM/jaysusm-portfolio"
    },
    {
      "title": "NBA Go",
      "subtitle": "NBA Livescoreboard mobile app",
      "image": "https://raw.githubusercontent.com/JaysusM/NBA-Go/master/android/app/src/main/res/mipmap-xxxhdpi/nba_go.png",
      "description": "NBA Go is a fan-made mobile app for real-time NBA scores, game schedules, player stats, and conference standings. It includes a player search feature with filters and career stats. Built with <b>Flutter</b>, it uses the <b>BLoC pattern</b> for state management, the <b>NBA API</b> for data, and <b>SQLite</b> to cache player data.",
      "techIcons": ["Flutter", "Dart", "SQLite"],
      "sourceCode": "https://github.com/JaysusM/NBA-Go"
    },
    {
      "title": "Vid.io",
      "image": "/vid_io.png",
      "subtitle": "App for screen capture and clip sharing.",
      "description": "VID.io is a webapp that enables users to capture and share screen recordings. It allows users to record their screen, store clips, and share them easily with others. The app is built with <b>Shadcn components</b> for a modern user interface, and uses <b>Auth0</b> for secure user authentication. Video clips are stored in <b>Amazon S3</b>, and the app uses <b>FFmpeg</b> for transcoding, ensuring that clips are in a shareable format.",
      "techIcons": ["React", "AWS", "Tailwind", "Next", "MongoDB", "Auth0"],
      "sourceCode": "https://github.com/JaysusM/vid.io",
      "demo": "https://vid-io.vercel.app/"
    }
  ],
  "jobs": [
    {
      "title": "Senior/Mid Software Engineer",
      "company": "2IG | May 2023 - Present",
      "description": "Developed backend solutions with <b>Node.js</b> and <b>GraphQL</b>, created microservices with <b>C#</b> and <b>RabbitMQ</b>, contributed to the frontend using <b>React</b>, implemented testing for software quality and integrated external APIs, deployed applications with <b>Docker</b>, managed CI/CD pipelines in <b>GitLab</b>, and utilized <b>Terraform</b> for infrastructure automation.",
      "image": "2ig.jpeg",
      "techIcons": [
        "Node",
        "GraphQL",
        "React",
        "Docker",
        "GitLab",
        "Terraform",
        "C#",
        "RabbitMQ"
      ]
    },
    {
      "title": "Software Engineer",
      "company": "FROGED | December 2020 - May 2023",
      "description": "Developed backend solutions with <b>Node.js</b> and <b>Express.js</b> using <b>DDD</b> and <b>CQRS</b> patterns, implemented <b>MongoDB</b> for data storage, contributed to the frontend using <b>React</b> and <b>Redux</b> for state management, collaborated with teams to ensure project deadlines were met. Integrated <b>Google API</b> for calendars, and <b>WhatsApp</b>, <b>Twitter</b>, and <b>Facebook</b> APIs for communication.",
      "image": "froged.jpeg",
      "techIcons": ["Node", "Angular", "Express", "MongoDB", "WhatsApp"]
    },
    {
      "title": "Software Engineer",
      "company": "Saal Digital | March 2020 - December 2020",
      "description": "Created web applications using <b>Angular</b> for dynamic user interfaces, developed RESTful APIs with <b>Node.js</b>, managed deployments with <b>AWS</b>, and set up CI/CD pipelines using <b>GitLab</b>. Used <b>Tailwind CSS</b> and <b>Webpack</b> to build the frontend and <b>Redux</b> to manage the application state. Integrated external services to enhance application functionality.",
      "image": "saal.jpeg",
      "techIcons": ["React", "Redux", "Tailwind", "AWS", "Webpack", "GitLab"]
    },
    {
      "title": "Web Developer Intern",
      "company": "Realcore Spain | July 2019 - September 2019",
      "description": "Assisted in developing web and mobile applications using <b>Angular</b> with <b>Ionic</b> and <b>Node.js</b>, supported backend development with <b>Express.js</b> and <b>MongoDB</b>, collaborated with the team to deliver features on time.",
      "image": "realcore.jpeg",
      "techIcons": ["Angular", "Node", "Express", "MongoDB", "Ionic"]
    }
  ]
}
